Revit 2027 API
BuiltInFailures.ElectricalFailures.MismatchConnectorDistSysToCircuit Property
 Cannot add [Element] to Circuit. The Type for the available connector does not match the Type ([Name]) for the Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchConnectorDistSysToCircuit { get; }
Public Shared ReadOnly Property MismatchConnectorDistSysToCircuit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchConnectorDistSysToCircuit {
	FailureDefinitionId^ get ();
}
static member MismatchConnectorDistSysToCircuit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace